DatanoiseTV/esp32-p4-dsi-mpe-controller/sdkconfig.defaults
# --- Target ---------------------------------------------------------------
CONFIG_IDF_TARGET="esp32p4"

# --- Flash (Waveshare ESP32-P4-Nano: 16 MB) ------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASH_BAUD=2000000
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200

# --- Partition table -----------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM (mandatory: 1024x600 RGB565 framebuffer = 1.2 MB) ------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# Route bulk allocations to PSRAM. Keep small allocs in internal RAM
# so WiFi/lwIP/mbedtls keep their fast pools (see memory note
# feedback_dont_starve_system_pools.md).
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# --- Optimization --------------------------------------------------------
# -O2 across the project: the paint inner loops + RTP packet building
# benefit visibly. Latency target is well under one display refresh
# (16.6 ms) end-to-end touch->wire.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# --- FreeRTOS ------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000

# --- Main task -----------------------------------------------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# --- Logging -------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# --- WiFi via on-board ESP32-C6 (esp_hosted over SDIO) -------------------
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y

# WiFi/IP event task — same headroom bump as the browser tree.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192

# --- lwIP --------------------------------------------------------------
# We send a steady stream of small UDP datagrams (one per touch sample
# at 100+ Hz, on two sockets). Bump the UDP PCB pool so the stack
# doesn't drop them under burst.
CONFIG_LWIP_MAX_UDP_PCBS=12
# Allow setting SO_REUSEADDR on our sockets (AppleMIDI binds two
# adjacent ports; useful when restarting without a clean TIME_WAIT).
CONFIG_LWIP_SO_REUSE=y

# --- Watchdog ------------------------------------------------------------
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
